[
    {
        "url": "img/pubg1.jpg",
        "caption": "PlayerUnknown's Battlegrounds",
        "rules": [
            {
                "ruleName": "Evolution",
                "rule": "You can only initially use melee weapons to attack enemies. You may loot the weapons of an enemy which you have killed."
            },
            {
                "ruleName": "Explosions",
                "rule": "You must only use explosives or throwables to attack enemies. You can use melee weapons and pistols if you have no explosives."
            },
            {
                "ruleName": "Mad Max",
                "rule": "You can only use vehicles to attack enemies, you are allowed to shoot aslong as youre inside the vehicle. You cannot get out of the vehicle except to heal or revive teammates."
            },
            {
                "ruleName": "Where am i?",
                "rule": "You should carry as much smoke grenades as possible as you can only attack enemies while you are inside a smoke cloud."
            },
            {
                "ruleName": "NPC",
                "rule": "You must always be running and crouching. If you wish to shoot, you must stop moving and stand up fully. You are not allowed to move while shooting."
            },
            {
                "ruleName": "Home Sweet Home",
                "rule": "You must pick a building to land on, make sure you choose wisely as this is the only loot you are allowed all game!"
            },
            {
                "ruleName": "Who are you?",
                "rule": "You have to call your teammates by their middle name."
            },
            {
                "ruleName": "No Healing",
                "rule": "You cannot use any healing items, including first aid kits and bandages. The only way you can heal is by finding energy drinks and painkillers."
            },
            {
                "ruleName": "Scavenger Hunt",
                "rule": "You cannot loot any buildings or structures. Instead, you must find all of your equipment by looting enemy corpses and supply drops."
            },
            {
                "ruleName": "Squadran",
                "rule": "There are four roles, Captain, Scout, Driver, Medic. The Captain makes all the decisions, no questions asked. Scout is the only sniper in the squad. Driver is the only one allowed to drive. Medic is the only one out of the team who is allowed to heal themselves and everyone else using EMT gear.  Players must choose their roles before the game starts. "
            }
        ]
    },
    {
        "url": "img/r61.jpg",
        "caption": "Rainbow Six Siege",
        "rules": [
            {
                "ruleName": "Shotguns Only",
                "rule": "All players must use shotguns only."
            },
            {
                "ruleName": "Recruit Main",
                "rule": "All players must select the Recruit operator"
            },
            {
                "ruleName": "Knife Fight",
                "rule": "All players must use their knives to attack the enemy team."
            },
            {
                "ruleName": "One Speed",
                "rule": "All players must select operators with only one speed rating."
            },
            {
                "ruleName": "Mr President",
                "rule": "Players must defend the president, the president is a player in the team of your choice. If the president dies everyone dies."
            },
            {
                "ruleName": "I Hate You!",
                "rule": "Each player must select the operator they hate the most."
            },
            {
                "ruleName": "The Beast",
                "rule": "secondary weapon only."
            },
            {
                "ruleName": "Wheres my phone",
                "rule": "No one is allowed to use their phones/cameras during the round."
            },
            {
                "ruleName": "No Destruction Please",
                "rule": "Defenders cannot reinforce any walls or hatches during the round. Attackers cannot destray any walls or hatches."
            },
            {
                "ruleName": "Who are you?",
                "rule": "You have to call your teammates by their middle name."
            }
        ]
    },
    {
        "url": "img/warzone1.jpg",
        "caption": "Warzone 2",
        "rules": [
            {
                "ruleName": "Evolution",
                "rule": "You can only initially use melee weapons to attack enemies. You may pick up and use any loot of an enemy which you have killed."
            },
            {
                "ruleName": "Explosions",
                "rule": "You must only use explosives or throwables to attack enemies. You can use melee weapons and pistols if you have no explosives."
            },
            {
                "ruleName": "Snipers Only",
                "rule": "Players can only use sniper rifles for the entire match."
            },
            {
                "ruleName": "No ADS",
                "rule": "Players are not allowed to aim down sights (ADS) for the entire match."
            },
            {
                "ruleName": "NPC",
                "rule": "You must always be running and cannot stop or crouch. If you wish to shoot, you must stop moving and crouch. you cannot move while shooting."
            },
            {
                "ruleName": "Loadout Swap",
                "rule": "Players must switch their loadout with the enemy they eliminate."
            },
            {
                "ruleName": "Who are you?",
                "rule": "You have to call your teammates by their middle name."
            },
            {
                "ruleName": "The Floor is Lava",
                "rule": "Players cannot touch the ground and must stay on top of buildings, vehicles, or other objects for the entire match."
            },
            {
                "ruleName": "Scavenger Hunt",
                "rule": "You cannot loot any buildings or structures. Instead, you must find all of your equipment by looting enemy corpses."
            },
            {
                "ruleName": "Squadran",
                "rule": "There are four roles, Captain, Scout, Driver, Medic. The Captain makes all the decisions, no questions asked. Scout is the only sniper in the squad. Driver is the only one allowed to drive. Medic is the only one out of the team who is allowed to carry shields.  Players must choose their roles before the game starts. "
            }
        ]
    },
    {
        "url": "img/rust1.jpg",
        "caption": "Rust",
        "rules": [
            {
                "ruleName": "Bunker Builders",
                "rule": "Your team can only build underground bases."
            },
            {
                "ruleName": "Road Warriors",
                "rule": "Your team must travel only by road, and you can't walk off from the path or go off-roading. You can't build any bases, and you have to scavenge for supplies along the way."
            },
            {
                "ruleName": "Pacific Rim",
                "rule": "Your team must build a base on stilts over the ocean, and you can only use metal in your construction."
            },
            {
                "ruleName": "Neighbours",
                "rule": "You can only have 1 base per person."
            },
            {
                "ruleName": "Scavenger",
                "rule": "You can only get loot from killing people."
            },
            {
                "ruleName": "Home Sweet Home",
                "rule": "You must pick a building to land on, make sure you choose wisely as this is the loot from the building is the only loot you are allowed all game!"
            },
            {
                "ruleName": "Who are you?",
                "rule": "You have to call your teammates by their middle name until you or they die."
            },
            {
                "ruleName": "No Healing",
                "rule": "You cannot use any healing items."
            },
            {
                "ruleName": "Shotguns Only",
                "rule": "You can only use shotgun type weapons until you die."
            },
            {
                "ruleName": "Eoka is the best",
                "rule": "With an eoka pistol. Kill on sight."
            }
        ]
    },
    {
        "url": "img/apexLegends1.png",
        "caption": "Apex Legends",
        "rules": [
            {
                "ruleName": "Pacifist Challenge",
                "rule": "You are not allowed to deal any damage to enemies until the final circle. Only healing and supporting your teammates is allowed until the endgame."
            },
            {
                "ruleName": "The Blind Spot",
                "rule": "One player on the team must play with their screen brightness turned all the way down."
            },
            {
                "ruleName": "Pistols only",
                "rule": "You can only use pistol type weapons."
            },
            {
                "ruleName": "No Communication",
                "rule": "The team is not allowed to communicate verbally or using the in-game ping system. Players must rely solely on their instincts and game sense."
            },
            {
                "ruleName": "NPC",
                "rule": "You must always be running and cannot stop or crouch. If you wish to shoot, you must stop moving and crouch. you cannot move while shooting."
            },
            {
                "ruleName": "No Armor Challenge",
                "rule": "You cannot use any armor throughout the match. Healing items are still allowed."
            },
            {
                "ruleName": "Who are you?",
                "rule": "You have to call your teammates by their middle name."
            },
            {
                "ruleName": "No Healing",
                "rule": "You cannot use any healing items, including first aid kits and bandages. You can only use shield cells."
            },
            {
                "ruleName": "Scavenger Hunt",
                "rule": "You cannot loot any buildings or structures. Instead, you must find all of your equipment by looting enemy corpses and supply drops."
            },
            {
                "ruleName": "I Like This Place",
                "rule": "The team must stay within the town that they landed on for the entire match"
            }
        ]
    },
    {
        "url": "img/rocket-league1.jpg",
        "caption": "Rocket League",
        "rules": [
            {
                "ruleName": "Small Pads",
                "rule": "Players can't pick up any max boost pads they can only pick up the small ones."
            },
            {
                "ruleName": "Reverse Only Challenge",
                "rule": "Players can only drive in reverse."
            },
            {
                "ruleName": "Your Turn",
                "rule": "Players can only hit the ball once before they have to pass it to a teammate."
            },
            {
                "ruleName": "No Jumping",
                "rule": "Players can't jump or double-jump."
            },
            {
                "ruleName": "Over Here!",
                "rule": "One player must always be at the midfield or beyond."
            },
            {
                "ruleName": "Demolition Derby",
                "rule": "Players must attempt to demolish an opposing player before they can take a shot on goal."
            },
            {
                "ruleName": "The Real MVP",
                "rule": "The player with the lowest score at the end of the game wins."
            },
            {
                "ruleName": "Eyes Forward",
                "rule": "play with no ball-cam for the entire game"
            },
            {
                "ruleName": "Air Ball",
                "rule": "You can only hit the ball if youre off the ground"
            },
            {
                "ruleName": "Our Side Is Better",
                "rule": "you cannot go onto the enemies half of the arena"
            }
        ]
    },
    {
        "url": "img/mario-kart1.jpg",
        "caption": "Mario Kart 8 Deluxe",
        "rules": [
            {
                "ruleName": "No drifting",
                "rule": "Players cannot use the drifting mechanic during the entire race."
            },
            {
                "ruleName": "One-handed",
                "rule": "Players must only use one hand to control their character during the entire race."
            },
            {
                "ruleName": "No items",
                "rule": "Players cannot use any items during the entire race."
            },
            {
                "ruleName": "Reverse controls",
                "rule": "Players must use their controller upside down."
            },
            {
                "ruleName": "Opposite direction",
                "rule": "Players must drive the course in reverse."
            },
            {
                "ruleName": "Blindfolded",
                "rule": "Player who is first after the fastest AI is the winner."
            },
            {
                "ruleName": "Hitman",
                "rule": "Your main goal is to hunt down another player and try and make them below top 10."
            },
            {
                "ruleName": "Chug-Jug",
                "rule": "Every player must down a pint of water before starting racing."
            },
            {
                "ruleName": "Lowest Score Wins",
                "rule": "Players with the lowest score wins."
            },
            {
                "ruleName": "Precious Items",
                "rule": "You are only allowed to use one item per game. "
            }
        ]
    },
    {
        "url": "img/war-thunder1.jpg",
        "caption": "war Thunder",
        "rules": [
            {
                "ruleName": "HEAT",
                "rule": "You can only use HEAT ammunition."
            },
            {
                "ruleName": "No Armor",
                "rule": "Play as a vehicle with little or no armor protection."
            },
            {
                "ruleName": "Little Thing",
                "rule": "You can only use low tier tanks for a high tier battle."
            },
            {
                "ruleName": "Smokey",
                "rule": "You can only fire smoke rounds."
            },
            {
                "ruleName": "Cant Stop Wont Stop",
                "rule": "You must never stop driving."
            },
            {
                "ruleName": "Objective",
                "rule": "You cannot leave the objective."
            },
            {
                "ruleName": "Who are you?",
                "rule": "You have to call your teammates by their middle name."
            },
            {
                "ruleName": "Squadran",
                "rule": "You are the leader of all tanks in your crew, you must command over all of them."
            },
            {
                "ruleName": "Mr President",
                "rule": "Players must defend the president, the president is a player in the team of your choice. If the president dies everyone dies."
            },
            {
                "ruleName": "10 Shots",
                "rule": "You can only bring 10 shells to the match."
            }
        ]
    },
    {
        "url": "img/minecraft1.jpg",
        "caption": "Minecraft Bed-Wars",
        "rules": [
            {
                "ruleName": "Fortress",
                "rule": "You are not allowed to leave your island, you must defend your own land."
            },
            {
                "ruleName": "Melee",
                "rule": "You can't use bows or arrows to attack the enemy team. You must rely solely on melee combat."
            },
            {
                "ruleName": "Noob",
                "rule": "You can only purchase the basic items, not the better versions of them."
            },
            {
                "ruleName": "Lonely Blocks",
                "rule": "No block can be placed directly next to another block in any structure you build."
            },
            {
                "ruleName": "Sneaky",
                "rule": "You must always be crouching."
            },
            {
                "ruleName": "Fist Fight",
                "rule": "You can only use your fists to attack enemies."
            },
            {
                "ruleName": "Ranger",
                "rule": "You can only use bows to attack enemies."
            },
            {
                "ruleName": "Im Hungry",
                "rule": "You cannot eat any food to regain hunger."
            },
            {
                "ruleName": "Bed Hunter",
                "rule": "Every enemy bed must be destroyed before you can attack enemies."
            },
            {
                "ruleName": "Primitive",
                "rule": "You can't use any enchanted weapons or armor for the entire match."
            }
        ]
    }
]